
# Добуток чисел
# Прибираю "#" перед Прикладом, котрий необхідно перевірити
# та закоментовую рядок з input() нижче.

# Приклад 1: Очікуваний результат: 2 (9*9*9=729 -> 7*2*9=126 -> 1*2*6=12 -> 1*2=2)
# number = 999

# Приклад 2: Очікуваний результат: 1000 -> 0
# number = 1000

# Приклад 3: Очікуваний результат: 423 -> 8
# number = 423

# Приклад 4: Очікуваний результат: 33 -> 9
# number = 33

# Приклад 5: Очікуваний результат: 25 -> 0
# number = 25

# Приклад 6: Очікуваний результат: 1 -> 1
# number = 1

number = int(input("Введіть ціле число: "))

while number > 9:
    product = 1

    for digit in str(number):
        product *= int(digit)

    number = product

print("Результат:", number)
