
import string

# 1. Отримую рядок від Користувача
user_input = input("Введіть рядок для перетворення на hashtag: ")

# 2. Роблю кожне слово з великої літери за допомогою .title()
# Цей метод також автоматично підготує літери після знаків пунктуації
processed_text = user_input.title()

# 3. Видаляю всі знаки пунктуації та пробіли
# Об'єдную рядок пунктуації із пробілом і в циклі замінюю їх на порожнечу " "
for char in string.punctuation + " ":
    processed_text = processed_text.replace(char, "")

# 4. Додаю символ '#' на початок
hashtag = "#" + processed_text

# 5. Перевіряю довжину: якщо вона більша за 140 символів, обрізаю за допомогою зрізу
if len(hashtag) > 140:
    hashtag = hashtag[:140]

# 6. Виводжу фінальний результат
print(hashtag)
