
# Знайти суму елементів із парними індексами

# Приклад 1: Очікуваний результат -> 88
# my_list = [0, 1, 7, 2, 4, 8]

# Приклад 2: Очікуваний результат -> 30
# my_list = [1, 3, 5]

# Приклад 3: Очікуваний результат -> 36
# my_list = [6]

# Приклад 4: Очікуваний результат -> 0
my_list = []

# 1. Перевіряю, чи список порожній
if len(my_list) == 0:
    result = 0
else:
    even_sum = 0  # Змінна для накопичення суми

    # 2. Перебираю індекси списку від 0 до кінця
    for i in range(len(my_list)):
        if i % 2 == 0:  # Якщо індекс парний
            even_sum += my_list[i]

    # 3. Беру останній елемент масиву
    last_element = my_list[-1]

    # 4. Перемножую отриману суму на останній елемент
    result = even_sum * last_element

# Вивід результату
print(result)
