
# Переміщення всіх нулів до кінця списку

# Приклад 1: Очікуваний результат -> [1, 12, 3, 0, 0]
# my_list = [0, 1, 0, 12, 3]

# Приклад 2: Очікуваний результат -> [0]
# my_list = [0]

# Приклад 3: Очікуваний результат -> [1, 13, 5, 0, 0, 0, 0]
# my_list = [1, 0, 13, 0, 0, 0, 5]

# Приклад 4: Очікуваний результат -> [9, 7, 31, 45, 45, 45, 96, 0, 0, 0, 0, 0, 0, 0]
my_list = [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0]

# Створюю два порожніх списки для розділення елементів
non_zeros = []
zeros = []

# Циклом перебираю елементи списку
for number in my_list:
    if number != 0:
        non_zeros.append(number)  # Ненульові числа йдуть сюди
    else:
        zeros.append(number)      # Нулі йдуть сюди

# Об'єдную списки (нулі опиняються у кінці)
my_list = non_zeros + zeros

# Виводжу результат
print(my_list)
