
# my_list = [1, 2, 3, 4, 5, 6]
# my_list = [1, 2, 3]
# my_list = [1, 2, 3, 4, 5]
# my_list = [1]
my_list = []

# Додаю 1 перед діленням, щоб у разі непарної кількості перший список отримав більше елементів
split_index = (len(my_list) + 1) // 2

# Формується новий список вже із двох зрізів
result = [my_list[:split_index], my_list[split_index:]]

print(f"Було => {my_list}")
print(f"Стало => {result}")

# Результат_1: [[1, 2, 3], [4, 5, 6]]
# Результат_2: [[1, 2], [3]]
# Результат_3: [[1, 2, 3], [4, 5]]
# Результат_4: [[1], []]
# Результат_5: [[], []]
